In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
mt = pd.read_csv("c:/python/movies_title.csv")

In [3]:
mt.sort_values(by = "year")

                                                    title  year
165182                                         Miss Jerry  1894
85708   Reproduction of the Corbett and Fitzsimmons Fight  1897
115903     Reproduction of the Corbett and Jeffries Fight  1899
198354        Sharkey-McCoy Fight Reproduced in 10 Rounds  1899
12582                                Family Troubles (II)  1900
...                                                   ...   ...
26537                                   Spider in the Web  2022
185368                                  The Tree of Death  2022
40476                                               Rosie  2022
199790                                     New in Village  2024
44198                                           Wild Runs  2024

[215981 rows x 2 columns]

In [4]:
mt.shape

(215981, 2)

In [5]:
mt.isnull()

        title   year
0       False  False
1       False  False
2       False  False
3       False  False
4       False  False
...       ...    ...
215976  False  False
215977  False  False
215978  False  False
215979  False  False
215980  False  False

[215981 rows x 2 columns]

In [6]:
mt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215981 entries, 0 to 215980
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   title   215981 non-null  object
 1   year    215981 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.3+ MB

In [7]:
mt.describe()

                year
count  215981.000000
mean     1984.553822
std        29.343957
min      1894.000000
25%      1965.000000
50%      1994.000000
75%      2010.000000
max      2024.000000

In [8]:
mt.dtypes

title    object
year      int64
dtype: object

In [9]:
mt.index

RangeIndex(start=0, stop=215981, step=1)

In [10]:
def necs(df):
    print("head = \n", df.head())
    print("-"*50)
    print("tail = \n",df.tail())
    print("-"*50)
    print("shape = \n",df.shape)
    print("-"*50)
    print("info = \n",df.info())
    print("-"*50)
    print("isnull = \n",df.isnull().sum())
    print("-"*50)
    print("describe = \n",df.describe())
    print("-"*50)
    print("title_data = \n",df["title"].value_counts())
    print("-"*50)
    print("year_data = \n",df["year"].value_counts())
    print("-"*50)
    print("col = \n", df.columns)

In [23]:
# 필수 명령어 실행
necs(mt)

head =
                      title  year
0           The Rising Son  1990
1        Ashes of Kukulcan  2016
2  The Thousand Plane Raid  1969
3         Crucea de piatra  1993
4                   The 86  2015
--------------------------------------------------
tail =
                       title  year
215976       Le mouton noir  1922
215977  Edge of the Unknown  2015
215978                E yue  2005
215979         Lakota Girls  2015
215980         The Sting II  1983
--------------------------------------------------
shape =
 (215981, 2)
--------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215981 entries, 0 to 215980
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   title   215981 non-null  object
 1   year    215981 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.3+ MB
info =
 None
--------------------------------------------------
isnull =
 title    0
year     0
dtype: int64
--------------------------------------------------
describe =
                 year
count  215981.000000
mean     1984.553822
std        29.343957
min      1894.000000
25%      1965.000000
50%      1994.000000
75%      2010.000000
max      2024.000000
--------------------------------------------------
title_data =
 Hamlet                  19
Carmen                  14
Macbeth                 14
The Three Musketeers    12
Maya                    11
                        ..
Pour toujours            1
Jiu qing mian mian       1
Country Hooker           1
Road to El Rey           1
Thor: Ragnarok           1
Name: title, Length: 197575, dtype: int64
--------------------------------------------------
year_data =
 2015    13978
2014     8209
2013     7664
2012     7273
2011     6844
        ...
1899        2
2024        2
1903        1
1897        1
1894        1
Name: year, Length: 124, dtype: int64
--------------------------------------------------
col =
 Index(['title', 'year'], dtype='object')

In [24]:
#전체 영화 개수
print("전체 영화 개수 = ", len(mt["title"]))
# mt.shpae[0]
# mt.count()
# mt["title"].count()
# mt.title.count()

전체 영화 개수 =  215981

In [27]:
#가장 빠른 시기에 제작된 영화 2개 찾기
ealy_movies = mt.sort_values(by="year").head(2)["title"].values
print("가장 빠른 시기에 제작된 영화 2개 = \n", ealy_movies)
# print(mt.sort_values(by="year").head(2))

가장 빠른 시기에 제작된 영화 2개 =
 ['Miss Jerry' 'Reproduction of the Corbett and Fitzsimmons Fight']

In [14]:
#제목이 "Hamlet"인 영화는 몇 개?
hamlet = []

for i in mt["title"]:
    if i == "Hamlet":
        hamlet.append(i)
print("제목이 'Hamlet'인 영화의 개수 = ", len(hamlet))

제목이 'Hamlet'인 영화의 개수 =  19

In [30]:
#제목이 "Treasure Island"인 영화는 몇 개? 제작년도 오름차순 나열
mt2 = mt.copy()
mt2 = mt2.loc[mt2["title"]=="Treasure Island"].sort_values(by="year")
ti = []
for i in mt2.values:
    ti.append(list(i))

print("제목이 'Treasure Island'인 영화의 개수(제작년도 오름차순 나열) = \n",len(ti),
      "\n",ti)

제목이 'Treasure Island'인 영화의 개수(제작년도 오름차순 나열) =
 8
 [['Treasure Island', 1918], ['Treasure Island', 1920], ['Treasure Island', 1934], ['Treasure Island', 1950], ['Treasure Island', 1972], ['Treasure Island', 1973], ['Treasure Island', 1985], ['Treasure Island', 1999]]

In [58]:
#1950년 ~ 1959년 사이에 만들어진 영화는 몇 개?
fifty_movies = []
for i in mt["year"]:
    if i >= 1950 and i <= 1959:
        fifty_movies.append(mt["title"])
print("1950년 ~ 1959년 사이 영화 개수 = ",len(fifty_movies))

1950년 ~ 1959년 사이 영화 개수 =  12120

### 년도별 영화를 가장 많이 제작된 해 top 5
1. 년도별 영화건수 누적
2. 내림차순 영화건수
3. top 5

In [59]:
#DataFrame
mt.groupby(["year"]).count().sort_values("title", ascending=False).head(5)

      title
year
2015  13978
2014   8209
2013   7664
2012   7273
2011   6844

In [60]:
#Series
mt.groupby("year").count()["title"].sort_values(ascending=False).head(5)

year
2015    13978
2014     8209
2013     7664
2012     7273
2011     6844
Name: title, dtype: int64